-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2025 年 1 月 10 日 02:59
-- サーバのバージョン： 10.4.28-MariaDB
-- PHP のバージョン: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `survey_condition`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `survey1_con_table`
--

CREATE TABLE `survey1_con_table` (
  `id` int(12) NOT NULL,
  `gender` varchar(64) NOT NULL,
  `generation` varchar(64) NOT NULL,
  `area` varchar(64) NOT NULL,
  `agree` varchar(64) NOT NULL,
  `condition1` varchar(64) NOT NULL,
  `condition2` varchar(64) DEFAULT NULL,
  `condition3` varchar(64) DEFAULT NULL,
  `condition4` varchar(64) DEFAULT NULL,
  `condition5` varchar(64) DEFAULT NULL,
  `condition6` varchar(64) DEFAULT NULL,
  `conditions` text NOT NULL,
  `date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `survey1_con_table`
--

INSERT INTO `survey1_con_table` (`id`, `gender`, `generation`, `area`, `agree`, `condition1`, `condition2`, `condition3`, `condition4`, `condition5`, `condition6`, `conditions`, `date`) VALUES
(1, '女性', '50代', '北海道', 'はい', 'イライラする・怒りっぽい', '倦怠感', NULL, NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感', '2025-01-10 01:00:02'),
(2, '男性', '20代', '青森県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, '', '2024-12-19 21:55:41'),
(3, '女性', '40代', '宮城県', 'はい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, NULL, '', '2024-12-19 22:03:05'),
(4, '男性', '50代', '岩手県', 'はい', '頭痛・頭が重い', '寝つきが悪い', NULL, NULL, NULL, NULL, '', '2024-12-19 22:51:36'),
(5, '未回答', '未回答', '神奈川県', 'はい', '寝つきが悪い', 'やる気が出ない', NULL, NULL, NULL, NULL, '', '2024-12-19 23:02:32'),
(6, '女性', '50代', '北海道', 'はい', '皮膚や目が乾燥しやすい', '肩こり・腰痛・関節痛', 'むくみ', 'やる気が出ない', '生理周期の乱れ', '食欲不振', '', '2024-12-19 23:27:44'),
(7, '男性', '40代', '神奈川県', 'はい', '倦怠感', '立ちくらみ・めまい・ふらつき', '寝つきが悪い', 'やる気が出ない', NULL, NULL, '', '2024-12-19 23:33:11'),
(8, '未回答', '未回答', '沖縄県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, '', '2024-12-19 23:36:56'),
(9, '女性', '20代', '大阪府', 'はい', '頭痛・頭が重い', '生理前に調子が悪い', '生理痛が重い', NULL, NULL, NULL, '', '2024-12-19 23:57:54'),
(10, '男性', '10代以下', '茨城県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, '', '2024-12-19 23:59:09'),
(11, '女性', '30代', '愛媛県', 'はい', 'むくみ', '生理痛が重い', NULL, NULL, NULL, NULL, '', '2024-12-20 00:28:45'),
(12, '女性', '60代以上', '北海道', 'はい', '頭痛・頭が重い', '動悸・息切れ', '皮膚や目が乾燥しやすい', '肩こり・腰痛・関節痛', 'むくみ', NULL, '', '2024-12-20 08:07:34'),
(13, '女性', '40代', '北海道', 'はい', 'イライラする・怒りっぽい', '頭痛・頭が重い', '倦怠感', '動悸・息切れ', '立ちくらみ・めまい・ふらつき', '皮膚や目が乾燥しやすい', '', '2024-12-26 10:37:59'),
(14, '女性', '30代', '福岡県', 'はい', '頭痛・頭が重い', '生理前に調子が悪い', '肌荒れ・ニキビ', NULL, NULL, NULL, '', '2024-12-26 11:14:15'),
(15, '女性', '50代', '青森県', 'はい', 'ぼーっとする・集中できない', '倦怠感', '動悸・息切れ', NULL, NULL, NULL, '', '2024-12-26 22:36:53'),
(16, '女性', '20代', '東京都', 'はい', 'イライラする・怒りっぽい', '情緒不安定', NULL, NULL, NULL, NULL, '', '2024-12-26 23:11:24'),
(17, '男性', '50代', '神奈川県', 'はい', '肩こり・腰痛・関節痛', 'やる気が出ない', NULL, NULL, NULL, NULL, '', '2024-12-26 23:31:15'),
(18, '女性', '40代', '青森県', 'はい', '倦怠感', '肩こり・腰痛・関節痛', '寝つきが悪い', NULL, NULL, NULL, '', '2024-12-27 10:57:04'),
(19, '男性', '60代以上', '愛知県', 'はい', 'イライラする・怒りっぽい', '動悸・息切れ', '皮膚や目が乾燥しやすい', NULL, NULL, NULL, '', '2024-12-27 14:39:04'),
(20, '女性', '30代', '山形県', 'はい', 'やる気が出ない', '生理前に調子が悪い', '生理周期の乱れ', NULL, NULL, NULL, '', '2024-12-27 15:03:45'),
(24, '未回答', '未回答', '熊本県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, '', '2024-12-27 15:06:02'),
(30, '未回答', '未回答', '茨城県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, '', '2024-12-27 16:16:40'),
(36, '未回答', '未回答', '茨城県', 'はい', 'やる気が出ない', '食欲不振', NULL, NULL, NULL, NULL, '', '2024-12-27 18:15:26'),
(39, '女性', '10代以下', '福岡県', 'はい', 'むくみ', '朝起きられない', '寝つきが悪い', 'やる気が出ない', NULL, NULL, '', '2024-12-27 18:37:46'),
(46, '女性', '10代以下', '福岡県', 'はい', '動悸・息切れ', '寝つきが悪い', NULL, NULL, NULL, NULL, '', '2024-12-27 23:46:32'),
(47, '女性', '40代', '栃木県', 'はい', '頭痛・頭が重い', '生理周期の乱れ', '過食', NULL, NULL, NULL, '頭痛・頭が重い,生理周期の乱れ,過食', '2025-01-08 17:45:57'),
(48, '女性', '50代', '北海道', 'はい', 'イライラする・怒りっぽい', '倦怠感', '動悸・息切れ', '皮膚や目が乾燥しやすい', '肩こり・腰痛・関節痛', NULL, '', '2024-12-28 09:47:51'),
(49, '女性', '30代', '福井県', 'はい', '寝つきが悪い', '生理痛が重い', '腹痛', NULL, NULL, NULL, '', '2024-12-28 23:52:49'),
(50, '男性', '40代', '群馬県', 'はい', '動悸・息切れ', '肩こり・腰痛・関節痛', '寝つきが悪い', NULL, NULL, NULL, '動悸・息切れ,肩こり・腰痛・関節痛,寝つきが悪い', '2025-01-08 17:01:26'),
(51, '未回答', '未回答', '千葉県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, '', '2024-12-29 16:51:17'),
(52, '女性', '20代', '埼玉県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'むくみ', NULL, NULL, NULL, '', '2024-12-29 16:59:08'),
(55, '女性', '50代', '北海道', 'はい', '倦怠感', '動悸・息切れ', '皮膚や目が乾燥しやすい', '肩こり・腰痛・関節痛', NULL, NULL, '', '2024-12-30 18:37:04'),
(57, '女性', '60代以上', '宮城県', 'はい', '倦怠感', '肩こり・腰痛・関節痛', 'むくみ', '食欲不振', NULL, NULL, '', '2024-12-30 23:43:16'),
(58, '男性', '40代', '青森県', 'はい', '動悸・息切れ', '寝つきが悪い', 'やる気が出ない', NULL, NULL, NULL, '動悸・息切れ,寝つきが悪い,やる気が出ない', '2025-01-01 00:52:32'),
(59, '男性', '40代', '青森県', 'はい', '動悸・息切れ', '朝起きられない', '寝つきが悪い', NULL, NULL, NULL, '動悸・息切れ,朝起きられない,寝つきが悪い', '2025-01-01 00:10:08'),
(63, '女性', '10代以下', '北海道', 'はい', 'イライラする・怒りっぽい', '頭痛・頭が重い', '朝起きられない', 'やる気が出ない', '腹痛', '肌荒れ・ニキビ', 'イライラする・怒りっぽい,頭痛・頭が重い,朝起きられない,やる気が出ない,腹痛,肌荒れ・ニキビ', '2025-01-01 01:08:11'),
(64, '女性', '40代', '三重県', 'はい', '肩こり・腰痛・関節痛', 'むくみ', '生理周期の乱れ', NULL, NULL, NULL, '肩こり・腰痛・関節痛,むくみ,生理周期の乱れ', '2025-01-01 22:47:09'),
(65, '女性', '50代', '群馬県', 'はい', 'イライラする・怒りっぽい', '動悸・息切れ', '肩こり・腰痛・関節痛', 'むくみ', NULL, NULL, 'イライラする・怒りっぽい,動悸・息切れ,肩こり・腰痛・関節痛,むくみ', '2025-01-02 08:37:16'),
(66, '男性', '50代', '東京都', 'はい', '頭痛・頭が重い', '倦怠感', '立ちくらみ・めまい・ふらつき', '肩こり・腰痛・関節痛', '寝つきが悪い', 'やる気が出ない', '頭痛・頭が重い,倦怠感,立ちくらみ・めまい・ふらつき,肩こり・腰痛・関節痛,寝つきが悪い,やる気が出ない', '2025-01-02 10:39:47'),
(69, '女性', '20代', '長崎県', 'はい', '頭痛・頭が重い', '生理痛が重い', '肌荒れ・ニキビ', '過食', NULL, NULL, '頭痛・頭が重い,生理痛が重い,肌荒れ・ニキビ,過食', '2025-01-02 11:19:01'),
(70, '女性', '20代', '長崎県', 'はい', '頭痛・頭が重い', '生理痛が重い', '肌荒れ・ニキビ', '過食', NULL, NULL, '頭痛・頭が重い,生理痛が重い,肌荒れ・ニキビ,過食', '2025-01-02 11:19:48'),
(71, '女性', '20代', '長崎県', 'はい', '頭痛・頭が重い', '生理痛が重い', '肌荒れ・ニキビ', '過食', NULL, NULL, '頭痛・頭が重い,生理痛が重い,肌荒れ・ニキビ,過食', '2025-01-02 11:20:09'),
(73, '女性', '30代', '青森県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, 'この中にはない', '2025-01-02 22:09:17'),
(74, '女性', '30代', '青森県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, 'この中にはない', '2025-01-02 22:27:24'),
(75, '女性', '20代', '宮城県', 'はい', '立ちくらみ・めまい・ふらつき', 'むくみ', NULL, NULL, NULL, NULL, '立ちくらみ・めまい・ふらつき,むくみ', '2025-01-02 22:31:56'),
(76, '男性', '30代', '新潟県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, 'この中にはない', '2025-01-02 22:34:47'),
(77, '女性', '10代以下', '長崎県', 'はい', '倦怠感', 'やる気が出ない', '生理痛が重い', NULL, NULL, NULL, '倦怠感,やる気が出ない,生理痛が重い', '2025-01-02 22:37:50'),
(78, '女性', '20代', '東京都', 'はい', '立ちくらみ・めまい・ふらつき', '生理前に調子が悪い', NULL, NULL, NULL, NULL, '立ちくらみ・めまい・ふらつき,生理前に調子が悪い', '2025-01-02 22:51:58'),
(79, '女性', '40代', '大分県', 'はい', '頭痛・頭が重い', '立ちくらみ・めまい・ふらつき', '生理周期の乱れ', NULL, NULL, NULL, '頭痛・頭が重い,立ちくらみ・めまい・ふらつき,生理周期の乱れ', '2025-01-04 11:07:16'),
(80, '女性', '40代', '鹿児島県', 'はい', 'ぼーっとする・集中できない', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'ぼーっとする・集中できない,倦怠感,やる気が出ない', '2025-01-08 16:05:24'),
(81, '未回答', '未回答', '兵庫県', 'はい', '肩こり・腰痛・関節痛', '寝つきが悪い', NULL, NULL, NULL, NULL, '肩こり・腰痛・関節痛,寝つきが悪い', '2025-01-08 16:49:31'),
(83, '女性', '10代以下', '秋田県', 'はい', 'イライラする・怒りっぽい', '頭痛・頭が重い', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,頭痛・頭が重い,やる気が出ない', '2025-01-08 23:08:44'),
(84, '女性', '30代', '鳥取県', 'はい', '立ちくらみ・めまい・ふらつき', '皮膚や目が乾燥しやすい', '肩こり・腰痛・関節痛', NULL, NULL, NULL, '立ちくらみ・めまい・ふらつき,皮膚や目が乾燥しやすい,肩こり・腰痛・関節痛', '2025-01-09 15:59:07'),
(85, '女性', '50代', '島根県', 'はい', '倦怠感', '立ちくらみ・めまい・ふらつき', '皮膚や目が乾燥しやすい', NULL, NULL, NULL, '倦怠感,立ちくらみ・めまい・ふらつき,皮膚や目が乾燥しやすい', '2025-01-09 16:03:25'),
(86, '未回答', '未回答', '滋賀県', 'いいえ', 'この中にはない', NULL, NULL, NULL, NULL, NULL, 'この中にはない', '2025-01-09 23:54:51'),
(87, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:01:16'),
(88, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:01:29'),
(89, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:02:14'),
(90, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:02:19'),
(91, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:02:52'),
(92, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:06:32'),
(93, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:08:58'),
(94, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:09:00'),
(95, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:09:03'),
(96, '女性', '10代以下', '長野県', 'はい', 'イライラする・怒りっぽい', '倦怠感', 'やる気が出ない', NULL, NULL, NULL, 'イライラする・怒りっぽい,倦怠感,やる気が出ない', '2025-01-10 00:09:41');

-- --------------------------------------------------------

--
-- テーブルの構造 `survey1_user_table`
--

CREATE TABLE `survey1_user_table` (
  `id` int(12) NOT NULL,
  `name` varchar(128) NOT NULL,
  `lid` varchar(128) NOT NULL,
  `lpw` varchar(255) NOT NULL,
  `control-flg` int(12) NOT NULL,
  `life-flg` int(12) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `survey1_user_table`
--

INSERT INTO `survey1_user_table` (`id`, `name`, `lid`, `lpw`, `control-flg`, `life-flg`) VALUES
(1, '管理者1', 'admin1', '$2y$10$yNtrkNMw/tfsiNeXqNRpQOwgx21bTvlrB/D649U/nxm864onf8y6q', 1, 1),
(2, '管理者2', 'admin2', '$2y$10$66aZQuZ1CJFOefXIWcR/Uu09s2PaIpmMfLGhf6u63OXtwGMyqKIuK', 1, 1),
(3, 'ゲスト1', 'guest1', '$2y$10$xYFHjHAH2tASx/.Yhtppnu2qFKpEYn9tvZ3WkExcrCEWz1yzgMfEq', 0, 1);

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `survey1_con_table`
--
ALTER TABLE `survey1_con_table`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `survey1_user_table`
--
ALTER TABLE `survey1_user_table`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `survey1_con_table`
--
ALTER TABLE `survey1_con_table`
  MODIFY `id` int(12) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=97;

--
-- テーブルの AUTO_INCREMENT `survey1_user_table`
--
ALTER TABLE `survey1_user_table`
  MODIFY `id` int(12) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
